FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_LM3S811_GCC/hw_include/pwm.c
/****************************************************************************** */
/* */
/*! Synchronizes all pending updates. */
/*! */
/*! \param ulBase is the base address of the PWM module. */
/*! \param ulGenBits are the PWM generator blocks to be updated.  Must be the */
/*! logical OR of any of \b PWM_GEN_0_BIT, \b PWM_GEN_1_BIT, or */
/*! \b PWM_GEN_2_BIT. */
/*! */
/*! For the selected PWM generators, this function causes all queued updates to */
/*! the period or pulse width to be applied the next time the corresponding */
/*! counter becomes zero. */
/*! */
/*! \return None. */
/* */
/****************************************************************************** */
#if defined( GROUP_syncupdate ) || defined( BUILD_ALL ) || defined( DOXYGEN )
    void PWMSyncUpdate( unsigned long ulBase,
                        unsigned long ulGenBits )
    {
        /* */
        /* Check the arguments. */
        /* */
        ASSERT( ulBase == PWM_BASE );
        ASSERT( !( ulGenBits & ~( PWM_GEN_0_BIT | PWM_GEN_1_BIT | PWM_GEN_2_BIT ) ) );

        /* */
        /* Update the PWM timing registers. */
        /* */
        HWREG( ulBase + PWM_O_CTL ) = ulGenBits;
    }
#endif /* if defined( GROUP_syncupdate ) || defined( BUILD_ALL ) || defined( DOXYGEN ) */

/****************************************************************************** */
/* */
/*! Synchronizes the counters in one or multiple PWM generator blocks. */
/*! */
/*! \param ulBase is the base address of the PWM module. */
/*! \param ulGenBits are the PWM generator blocks to be synchronized.  Must be */
/*! the logical OR of any of \b PWM_GEN_0_BIT, \b PWM_GEN_1_BIT, or */
/*! \b PWM_GEN_2_BIT. */
/*! */
/*! For the selected PWM module, this function synchronizes the time base */
/*! of the generator blocks by causing the specified generator counters to be */
/*! reset to zero. */
/*! */
/*! \return None. */
/* */
/****************************************************************************** */
#if defined( GROUP_synctimebase ) || defined( BUILD_ALL ) || defined( DOXYGEN )
    void PWMSyncTimeBase( unsigned long ulBase,
                          unsigned long ulGenBits )
    {
        /* */
        /* Check the arguments. */
        /* */
        ASSERT( ulBase == PWM_BASE );
        ASSERT( !( ulGenBits & ~( PWM_GEN_0_BIT | PWM_GEN_1_BIT | PWM_GEN_2_BIT ) ) );

        /* */
        /* Synchronize the counters in the specified generators by writing to */
        /* the module's synchronization register. */
        /* */
        HWREG( ulBase + PWM_O_SYNC ) = ulGenBits;
    }
#endif /* if defined( GROUP_synctimebase ) || defined( BUILD_ALL ) || defined( DOXYGEN ) */

/****************************************************************************** */
/* */
/*! Enables or disables PWM outputs. */
/*! */
/*! \param ulBase is the base address of the PWM module. */
/*! \param ulPWMOutBits are the PWM outputs to be modified.  Must be the */
/*! logical OR of any of \b PWM_OUT_0_BIT, \b PWM_OUT_1_BIT, \b PWM_OUT_2_BIT, */
/*! \b PWM_OUT_3_BIT, \b PWM_OUT_4_BIT, or \b PWM_OUT_5_BIT. */
/*! \param bEnable determines if the signal is enabled or disabled. */
/*! */
/*! This function is used to enable or disable the selected PWM outputs.  The */
/*! outputs are selected using the parameter \e ulPWMOutBits.  The parameter */
/*! \e bEnable determines the state of the selected outputs.  If \e bEnable is */
/*! \b true, then the selected PWM outputs are enabled, or placed in the active */
/*! state.  If \e bEnable is \b false, then the selected outputs are disabled, */
/*! or placed in the inactive state. */
/*! */
/*! \return None. */
/* */
/****************************************************************************** */
#if defined( GROUP_outputstate ) || defined( BUILD_ALL ) || defined( DOXYGEN )
    void PWMOutputState( unsigned long ulBase,
                         unsigned long ulPWMOutBits,
                         tBoolean bEnable )
    {
        /* */
        /* Check the arguments. */
        /* */
        ASSERT( ulBase == PWM_BASE );
        ASSERT( !( ulPWMOutBits & ~( PWM_OUT_0_BIT | PWM_OUT_1_BIT | PWM_OUT_2_BIT |
                                     PWM_OUT_3_BIT | PWM_OUT_4_BIT | PWM_OUT_5_BIT ) ) );

        /* */
        /* Read the module's ENABLE output control register, and set or clear */
        /* the requested bits. */
        /* */
        if( bEnable == true )
        {
            HWREG( ulBase + PWM_O_ENABLE ) |= ulPWMOutBits;
        }
        else
        {
            HWREG( ulBase + PWM_O_ENABLE ) &= ~( ulPWMOutBits );
        }
    }
#endif /* if defined( GROUP_outputstate ) || defined( BUILD_ALL ) || defined( DOXYGEN ) */

/****************************************************************************** */
/* */
/*! Selects the inversion mode for PWM outputs. */
/*! */
/*! \param ulBase is the base address of the PWM module. */
/*! \param ulPWMOutBits are the PWM outputs to be modified.  Must be the */
/*! logical OR of any of \b PWM_OUT_0_BIT, \b PWM_OUT_1_BIT, \b PWM_OUT_2_BIT, */
/*! \b PWM_OUT_3_BIT, \b PWM_OUT_4_BIT, or \b PWM_OUT_5_BIT. */
/*! \param bInvert determines if the signal is inverted or passed through. */
/*! */
/*! This function is used to select the inversion mode for the selected PWM */
/*! outputs.  The outputs are selected using the parameter \e ulPWMOutBits. */
/*! The parameter \e bInvert determines the inversion mode for the selected */
/*! outputs.  If \e bInvert is \b true, this function will cause the specified */
/*! PWM output signals to be inverted, or made active low.  If \e bInvert is */
/*! \b false, the specified output will be passed through as is, or be made */
/*! active high. */
/*! */
/*! \return None. */
/* */
/****************************************************************************** */
#if defined( GROUP_outputinvert ) || defined( BUILD_ALL ) || defined( DOXYGEN )
    void PWMOutputInvert( unsigned long ulBase,
                          unsigned long ulPWMOutBits,
                          tBoolean bInvert )
    {
        /* */
        /* Check the arguments. */
        /* */
        ASSERT( ulBase == PWM_BASE );
        ASSERT( !( ulPWMOutBits & ~( PWM_OUT_0_BIT | PWM_OUT_1_BIT | PWM_OUT_2_BIT |
                                     PWM_OUT_3_BIT | PWM_OUT_4_BIT | PWM_OUT_5_BIT ) ) );

        /* */
        /* Read the module's INVERT output control register, and set or clear */
        /* the requested bits. */
        /* */
        if( bInvert == true )
        {
            HWREG( ulBase + PWM_O_INVERT ) |= ulPWMOutBits;
        }
        else
        {
            HWREG( ulBase + PWM_O_INVERT ) &= ~( ulPWMOutBits );
        }
    }
#endif /* if defined( GROUP_outputinvert ) || defined( BUILD_ALL ) || defined( DOXYGEN ) */

/****************************************************************************** */
/* */
/*! Specifies the state of PWM outputs in response to a fault condition. */
/*! */
/*! \param ulBase is the base address of the PWM module. */
/*! \param ulPWMOutBits are the PWM outputs to be modified.  Must be the */
/*! logical OR of any of \b PWM_OUT_0_BIT, \b PWM_OUT_1_BIT, \b PWM_OUT_2_BIT, */
/*! \b PWM_OUT_3_BIT, \b PWM_OUT_4_BIT, or \b PWM_OUT_5_BIT. */
/*! \param bFaultKill determines if the signal is killed or passed through */
/*! during an active fault condition. */
/*! */
/*! This function sets the fault handling characteristics of the selected PWM */
/*! outputs.  The outputs are selected using the parameter \e ulPWMOutBits. */
/*! The parameter \e bFaultKill determines the fault handling characteristics */
/*! for the selected outputs.  If \e bFaultKill is \b true, then the selected */
/*! outputs will be made inactive.  If \e bFaultKill is \b false, then the */
/*! selected outputs are unaffected by the detected fault. */
/*! */
/*! \return None. */
/* */
/****************************************************************************** */
#if defined( GROUP_outputfault ) || defined( BUILD_ALL ) || defined( DOXYGEN )
    void PWMOutputFault( unsigned long ulBase,
                         unsigned long ulPWMOutBits,
                         tBoolean bFaultKill )
    {
        /* */
        /* Check the arguments. */
        /* */
        ASSERT( ulBase == PWM_BASE );
        ASSERT( !( ulPWMOutBits & ~( PWM_OUT_0_BIT | PWM_OUT_1_BIT | PWM_OUT_2_BIT |
                                     PWM_OUT_3_BIT | PWM_OUT_4_BIT | PWM_OUT_5_BIT ) ) );

        /* */
        /* Read the module's FAULT output control register, and set or clear */
        /* the requested bits. */
        /* */
        if( bFaultKill == true )
        {
            HWREG( ulBase + PWM_O_FAULT ) |= ulPWMOutBits;
        }
        else
        {
            HWREG( ulBase + PWM_O_FAULT ) &= ~( ulPWMOutBits );
        }
    }
#endif /* if defined( GROUP_outputfault ) || defined( BUILD_ALL ) || defined( DOXYGEN ) */

/****************************************************************************** */
/* */
/*! Registers an interrupt handler for the specified PWM generator block. */
/*! */
/*! \param ulBase is the base address of the PWM module. */
/*! \param ulGen is the PWM generator in question. */
/*! \param pfnIntHandler is a pointer to the function to be called when the PWM */
/*! generator interrupt occurs. */
/*! */
/*! This function will ensure that the interrupt handler specified by */
/*! \e pfnIntHandler is called when an interrupt is detected for the specified */
/*! PWM generator block.  This function will also enable the corresponding */
/*! PWM generator interrupt in the interrupt controller; individual generator */
/*! interrupts and interrupt sources must be enabled with PWMIntEnable() and */
/*! PWMGenIntTrigEnable(). */
/*! */
/*! \sa IntRegister() for important information about registering interrupt */
/*! handlers. */
/*! */
/*! \return None. */
/* */
/****************************************************************************** */
#if defined( GROUP_genintregister ) || defined( BUILD_ALL ) || defined( DOXYGEN )
    void PWMGenIntRegister( unsigned long ulBase,
                            unsigned long ulGen,
                            void ( * pfnIntHandler )( void ) )
    {
        unsigned long ulInt;

        /* */
        /* Check the arguments. */
        /* */
        ASSERT( ulBase == PWM_BASE );
        ASSERT( ( ulGen == PWM_GEN_0 ) || ( ulGen == PWM_GEN_1 ) ||
                ( ulGen == PWM_GEN_2 ) );

        /* */
        /* Get the interrupt number associated with the specified generator. */
        /* */
        ulInt = INT_PWM0 + ( ulGen >> 6 ) - 1;

        /* */
        /* Register the interrupt handler. */
        /* */
        IntRegister( ulInt, pfnIntHandler );

        /* */
        /* Enable the PWMx interrupt. */
        /* */
        IntEnable( ulInt );
    }
#endif /* if defined( GROUP_genintregister ) || defined( BUILD_ALL ) || defined( DOXYGEN ) */

/****************************************************************************** */
/* */
/*! Removes an interrupt handler for the specified PWM generator block. */
/*! */
/*! \param ulBase is the base address of the PWM module. */
/*! \param ulGen is the PWM generator in question. */
/*! */
/*! This function will unregister the interrupt handler for the specified */
/*! PWM generator block.  This function will also disable the corresponding */
/*! PWM generator interrupt in the interrupt controller; individual generator */
/*! interrupts and interrupt sources must be disabled with PWMIntDisable() and */
/*! PWMGenIntTrigDisable(). */
/*! */
/*! \sa IntRegister() for important information about registering interrupt */
/*! handlers. */
/*! */
/*! \return None. */
/* */
/****************************************************************************** */
#if defined( GROUP_genintunregister ) || defined( BUILD_ALL ) || defined( DOXYGEN )
    void PWMGenIntUnregister( unsigned long ulBase,
                              unsigned long ulGen )
    {
        unsigned long ulInt;

        /* */
        /* Check the arguments. */
        /* */
        ASSERT( ulBase == PWM_BASE );
        ASSERT( ( ulGen == PWM_GEN_0 ) || ( ulGen == PWM_GEN_1 ) ||
                ( ulGen == PWM_GEN_2 ) );

        /* */
        /* Get the interrupt number associated with the specified generator. */
        /* */
        ulInt = INT_PWM0 + ( ulGen >> 6 ) - 1;

        /* */
        /* Disable the PWMx interrupt. */
        /* */
        IntDisable( ulInt );

        /* */
        /* Unregister the interrupt handler. */
        /* */
        IntUnregister( ulInt );
    }
#endif /* if defined( GROUP_genintunregister ) || defined( BUILD_ALL ) || defined( DOXYGEN ) */

/****************************************************************************** */
/* */
/*! Registers an interrupt handler for a fault condition detected in a PWM */
/*! module. */
/*! */
/*! \param ulBase is the base address of the PWM module. */
/*! \param pfnIntHandler is a pointer to the function to be called when the PWM */
/*! fault interrupt occurs. */
/*! */
/*! This function will ensure that the interrupt handler specified by */
/*! \e pfnIntHandler is called when a fault interrupt is detected for the */
/*! selected PWM module.  This function will also enable the PWM fault */
/*! interrupt in the NVIC; the PWM fault interrupt must also be enabled at the */
/*! module level using PWMIntEnable(). */
/*! */
/*! \sa IntRegister() for important information about registering interrupt */
/*! handlers. */
/*! */
/*! \return None. */
/* */
/****************************************************************************** */
#if defined( GROUP_faultintregister ) || defined( BUILD_ALL ) || defined( DOXYGEN )
    void PWMFaultIntRegister( unsigned long ulBase,
                              void ( * pfnIntHandler )( void ) )
    {
        /* */
        /* Check the arguments. */
        /* */
        ASSERT( ulBase == PWM_BASE );

        /* */
        /* Register the interrupt handler, returning an error if one occurs. */
        /* */
        IntRegister( INT_PWM_FAULT, pfnIntHandler );

        /* */
        /* Enable the PWM fault interrupt. */
        /* */
        IntEnable( INT_PWM_FAULT );
    }
#endif /* if defined( GROUP_faultintregister ) || defined( BUILD_ALL ) || defined( DOXYGEN ) */

/****************************************************************************** */
/* */
/*! Removes the PWM fault condition interrupt handler. */
/*! */
/*! \param ulBase is the base address of the PWM module. */
/*! */
/*! This function will remove the interrupt handler for a PWM fault interrupt */
/*! from the selected PWM module.  This function will also disable the PWM */
/*! fault interrupt in the NVIC; the PWM fault interrupt must also be disabled */
/*! at the module level using PWMIntDisable(). */
/*! */
/*! \sa IntRegister() for important information about registering interrupt */
/*! handlers. */
/*! */
/*! \return None. */
/* */
/****************************************************************************** */
#if defined( GROUP_faultintunregister ) || defined( BUILD_ALL ) || defined( DOXYGEN )
    void PWMFaultIntUnregister( unsigned long ulBase )
    {
        /* */
        /* Check the arguments. */
        /* */
        ASSERT( ulBase == PWM_BASE );

        /* */
        /* Disable the PWM fault interrupt. */
        /* */
        IntDisable( INT_PWM_FAULT );

        /* */
        /* Unregister the interrupt handler, returning an error if one occurs. */
        /* */
        IntUnregister( INT_PWM_FAULT );
    }
#endif /* if defined( GROUP_faultintunregister ) || defined( BUILD_ALL ) || defined( DOXYGEN ) */

/****************************************************************************** */
/* */
/*! Enables interrupts and triggers for the specified PWM generator block. */
/*! */
/*! \param ulBase is the base address of the PWM module. */
/*! \param ulGen is the PWM generator to have interrupts and triggers enabled. */
/*! Must be one of \b PWM_GEN_0, \b PWM_GEN_1, or \b PWM_GEN_2. */
/*! \param ulIntTrig specifies the interrupts and triggers to be enabled. */
/*! */
/*! Unmasks the specified interrupt(s) and trigger(s) by setting the */
/*! specified bits of the interrupt/trigger enable register for the specified */
/*! PWM generator.  The defined values for the bits are as follows: */
/*! */
/*! - PWM_INT_CNT_ZERO */
/*! - PWM_INT_CNT_LOAD */
/*! - PWM_INT_CMP_AU */
/*! - PWM_INT_CMP_AD */
/*! - PWM_INT_CMP_BU */
/*! - PWM_INT_CMP_BD */
/*! - PWM_TR_CNT_ZERO */
/*! - PWM_TR_CNT_LOAD */
/*! - PWM_TR_CMP_AU */
/*! - PWM_TR_CMP_AD */
/*! - PWM_TR_CMP_BU */
/*! - PWM_TR_CMP_BD */
/*! */
/*! \return None. */
/* */
/****************************************************************************** */
#if defined( GROUP_geninttrigenable ) || defined( BUILD_ALL ) || defined( DOXYGEN )
    void PWMGenIntTrigEnable( unsigned long ulBase,
                              unsigned long ulGen,
                              unsigned long ulIntTrig )
    {
        /* */
        /* Check the arguments. */
        /* */
        ASSERT( ulBase == PWM_BASE );
        ASSERT( ( ulGen == PWM_GEN_0 ) || ( ulGen == PWM_GEN_1 ) ||
                ( ulGen == PWM_GEN_2 ) );

        /* */
        /* Enable the specified interrupts/triggers. */
        /* */
        HWREG( PWM_GEN_BADDR( ulBase, ulGen ) + PWM_O_X_INTEN ) |= ulIntTrig;
    }
#endif /* if defined( GROUP_geninttrigenable ) || defined( BUILD_ALL ) || defined( DOXYGEN ) */

/****************************************************************************** */
/* */
/*! Disables interrupts for the specified PWM generator block. */
/*! */
/*! \param ulBase is the base address of the PWM module. */
/*! \param ulGen is the PWM generator to have interrupts and triggers disabled. */
/*! Must be one of \b PWM_GEN_0, \b PWM_GEN_1, or \b PWM_GEN_2. */
/*! \param ulIntTrig specifies the interrupts and triggers to be disabled. */
/*! */
/*! Masks the specified interrupt(s) and trigger(s) by clearing the */
/*! specified bits of the interrupt/trigger enable register for the specified */
/*! PWM generator.  The defined values for the bits are as follows: */
/*! */
/*! - PWM_INT_CNT_ZERO */
/*! - PWM_INT_CNT_LOAD */
/*! - PWM_INT_CMP_AU */
/*! - PWM_INT_CMP_AD */
/*! - PWM_INT_CMP_BU */
/*! - PWM_INT_CMP_BD */
/*! - PWM_TR_CNT_ZERO */
/*! - PWM_TR_CNT_LOAD */
/*! - PWM_TR_CMP_AU */
/*! - PWM_TR_CMP_AD */
/*! - PWM_TR_CMP_BU */
/*! - PWM_TR_CMP_BD */
/*! */
/*! \return None. */
/* */
/****************************************************************************** */
#if defined( GROUP_geninttrigdisable ) || defined( BUILD_ALL ) || defined( DOXYGEN )
    void PWMGenIntTrigDisable( unsigned long ulBase,
                               unsigned long ulGen,
                               unsigned long ulIntTrig )
    {
        /* */
        /* Check the arguments. */
        /* */
        ASSERT( ulBase == PWM_BASE );
        ASSERT( ( ulGen == PWM_GEN_0 ) || ( ulGen == PWM_GEN_1 ) ||
                ( ulGen == PWM_GEN_2 ) );

        /* */
        /* Disable the specified interrupts/triggers. */
        /* */
        HWREG( PWM_GEN_BADDR( ulBase, ulGen ) + PWM_O_X_INTEN ) &= ~( ulIntTrig );
    }
#endif /* if defined( GROUP_geninttrigdisable ) || defined( BUILD_ALL ) || defined( DOXYGEN ) */

/****************************************************************************** */
/* */
/*! Gets interrupt status for the specified PWM generator block. */
/*! */
/*! \param ulBase is the base address of the PWM module. */
/*! \param ulGen is the PWM generator to query.  Must be one of \b PWM_GEN_0, */
/*! \b PWM_GEN_1, or \b PWM_GEN_2. */
/*! \param bMasked specifies whether masked or raw interrupt status is */
/*! returned. */
/*! */
/*! If \e bMasked is set as \b true, then the masked interrupt status is */
/*! returned; otherwise, the raw interrupt status will be returned. */
/*! */
/*! \return Returns the contents of the interrupt status register, or the */
/*! contents of the raw interrupt status register, for the specified */
/*! PWM generator. */
/* */
/****************************************************************************** */
#if defined( GROUP_genintstatus ) || defined( BUILD_ALL ) || defined( DOXYGEN )
    unsigned long PWMGenIntStatus( unsigned long ulBase,
                                   unsigned long ulGen,
                                   tBoolean bMasked )
    {
        /* */
        /* Check the arguments. */
        /* */
        ASSERT( ulBase == PWM_BASE );
        ASSERT( ( ulGen == PWM_GEN_0 ) || ( ulGen == PWM_GEN_1 ) ||
                ( ulGen == PWM_GEN_2 ) );

        /* */
        /* Compute the generator's base address. */
        /* */
        ulGen = PWM_GEN_BADDR( ulBase, ulGen );

        /* */
        /* Read and return the specified generator's raw or enabled interrupt */
        /* status. */
        /* */
        if( bMasked == true )
        {
            return( HWREG( ulGen + PWM_O_X_ISC ) );
        }
        else
        {
            return( HWREG( ulGen + PWM_O_X_RIS ) );
        }
    }
#endif /* if defined( GROUP_genintstatus ) || defined( BUILD_ALL ) || defined( DOXYGEN ) */

/****************************************************************************** */
/* */
/*! Clears the specified interrupt(s) for the specified PWM generator block. */
/*! */
/*! \param ulBase is the base address of the PWM module. */
/*! \param ulGen is the PWM generator to query.  Must be one of \b PWM_GEN_0, */
/*! \b PWM_GEN_1, or \b PWM_GEN_2. */
/*! \param ulInts specifies the interrupts to be cleared. */
/*! */
/*! Clears the specified interrupt(s) by writing a 1 to the specified bits */
/*! of the interrupt status register for the specified PWM generator.  The */
/*! defined values for the bits are as follows: */
/*! */
/*! - PWM_INT_CNT_ZERO */
/*! - PWM_INT_CNT_LOAD */
/*! - PWM_INT_CMP_AU */
/*! - PWM_INT_CMP_AD */
/*! - PWM_INT_CMP_BU */
/*! - PWM_INT_CMP_BD */
/*! */
/*! \return None. */
/* */
/****************************************************************************** */
#if defined( GROUP_genintclear ) || defined( BUILD_ALL ) || defined( DOXYGEN )
    void PWMGenIntClear( unsigned long ulBase,
                         unsigned long ulGen,
                         unsigned long ulInts )
    {
        /* */
        /* Check the arguments. */
        /* */
        ASSERT( ulBase == PWM_BASE );
        ASSERT( ( ulGen == PWM_GEN_0 ) || ( ulGen == PWM_GEN_1 ) ||
                ( ulGen == PWM_GEN_2 ) );

        /* */
        /* Clear the requested interrupts by writing ones to the specified bit */
        /* of the module's interrupt enable register. */
        /* */
        HWREG( PWM_GEN_BADDR( ulBase, ulGen ) + PWM_O_X_ISC ) = ulInts;
    }
#endif /* if defined( GROUP_genintclear ) || defined( BUILD_ALL ) || defined( DOXYGEN ) */

/****************************************************************************** */
/* */
/*! Enables generator and fault interrupts for a PWM module. */
/*! */
/*! \param ulBase is the base address of the PWM module. */
/*! \param ulGenFault contains the interrupts to be enabled.  Must be a logical */
/*! OR of any of \b PWM_INT_GEN_0, \b PWM_INT_GEN_1, \b PWM_INT_GEN_2, or */
/*! \b PWM_INT_FAULT. */
/*! */
/*! Unmasks the specified interrupt(s) by setting the specified bits of */
/*! the interrupt enable register for the selected PWM module. */
/*! */
/*! \return None. */
/* */
/****************************************************************************** */
#if defined( GROUP_intenable ) || defined( BUILD_ALL ) || defined( DOXYGEN )
    void PWMIntEnable( unsigned long ulBase,
                       unsigned long ulGenFault )
    {
        /* */
        /* Check the arguments. */
        /* */
        ASSERT( ulBase == PWM_BASE );

