FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_LM3S811_GCC/hw_include/pwm.c
        /* */
        /* Read the module's interrupt enable register, and enable interrupts */
        /* for the specified PWM generators. */
        /* */
        HWREG( ulBase + PWM_O_INTEN ) |= ulGenFault;
    }
#endif /* if defined( GROUP_intenable ) || defined( BUILD_ALL ) || defined( DOXYGEN ) */

/****************************************************************************** */
/* */
/*! Disables generator and fault interrupts for a PWM module. */
/*! */
/*! \param ulBase is the base address of the PWM module. */
/*! \param ulGenFault contains the interrupts to be disabled.  Must be a */
/*! logical OR of any of \b PWM_INT_GEN_0, \b PWM_INT_GEN_1, \b PWM_INT_GEN_2, */
/*! or \b PWM_INT_FAULT. */
/*! */
/*! Masks the specified interrupt(s) by clearing the specified bits of */
/*! the interrupt enable register for the selected PWM module. */
/*! */
/*! \return None. */
/* */
/****************************************************************************** */
#if defined( GROUP_intdisable ) || defined( BUILD_ALL ) || defined( DOXYGEN )
    void PWMIntDisable( unsigned long ulBase,
                        unsigned long ulGenFault )
    {
        /* */
        /* Check the arguments. */
        /* */
        ASSERT( ulBase == PWM_BASE );

        /* */
        /* Read the module's interrupt enable register, and disable interrupts */
        /* for the specified PWM generators. */
        /* */
        HWREG( ulBase + PWM_O_INTEN ) &= ~( ulGenFault );
    }
#endif /* if defined( GROUP_intdisable ) || defined( BUILD_ALL ) || defined( DOXYGEN ) */

/****************************************************************************** */
/* */
/*! Clears the fault interrupt for a PWM module. */
/*! */
/*! \param ulBase is the base address of the PWM module. */
/*! */
/*! Clears the fault interrupt by writing to the appropriate bit of the */
/*! interrupt status register for the selected PWM module. */
/*! */
/*! \return None. */
/* */
/****************************************************************************** */
#if defined( GROUP_faultintclear ) || defined( BUILD_ALL ) || defined( DOXYGEN )
    void PWMFaultIntClear( unsigned long ulBase )
    {
        /* */
        /* Check the arguments. */
        /* */
        ASSERT( ulBase == PWM_BASE );

        /* */
        /* Write the only writeable bit in the module's interrupt register. */
        /* */
        HWREG( ulBase + PWM_O_ISC ) = PWM_INT_INTFAULT;
    }
#endif /* if defined( GROUP_faultintclear ) || defined( BUILD_ALL ) || defined( DOXYGEN ) */

/****************************************************************************** */
/* */
/*! Gets the interrupt status for a PWM module. */
/*! */
/*! \param ulBase is the base address of the PWM module. */
/*! \param bMasked specifies whether masked or raw interrupt status is */
/*! returned. */
/*! */
/*! If \e bMasked is set as \b true, then the masked interrupt status is */
/*! returned; otherwise, the raw interrupt status will be returned. */
/*! */
/*! \return The current interrupt status, enumerated as a bit field of */
/*! \b PWM_INT_GEN_0, \b PWM_INT_GEN_1, \b PWM_INT_GEN_2, and \b PWM_INT_FAULT. */
/*! */
/****************************************************************************** */
#if defined( GROUP_intstatus ) || defined( BUILD_ALL ) || defined( DOXYGEN )
    unsigned long PWMIntStatus( unsigned long ulBase,
                                tBoolean bMasked )
    {
        /* */
        /* Check the arguments. */
        /* */
        ASSERT( ulBase == PWM_BASE );

        /* */
        /* Read and return either the module's raw or enabled interrupt status. */
        /* */
        if( bMasked == true )
        {
            return( HWREG( ulBase + PWM_O_ISC ) );
        }
        else
        {
            return( HWREG( ulBase + PWM_O_RIS ) );
        }
    }
#endif /* if defined( GROUP_intstatus ) || defined( BUILD_ALL ) || defined( DOXYGEN ) */

/****************************************************************************** */
/* */
/* Close the Doxygen group. */
/*! @} */
/* */
/****************************************************************************** */
